<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas II

## 1.0 Importing our Libraries

In [3]:
# Importing the libraries we will need 

# Importing the pandas library
# 
import pandas as pd

# Importing the numpy library
#
import numpy as np

## 1.1 Reading the Dataset from our CSV file

This dataset contains trips taken by thousands of kenyans to and from Nairobi during the year 2018.

*   Dataset link for download or access: [Link](https://drive.google.com/a/moringaschool.com/file/d/1xe2sHapdeGo7bIaiG7UV0rjgQZ5U6OXv/view?usp=sharing)

In [4]:
# Let's read the data from the CSV file and create the dataframe to be used
# 
data_url = 'datasets/bus_travels.csv'
df = pd.read_csv(data_url)
df.head(5)

,ride_id,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,247,2018-05-07,07:06,Kisii,Nairobi,Bus,49
1,256,2018-05-06,11:08,Kisii,Nairobi,shuttle,11
2,275,2018-05-04,05:00,Kisii,Nairobi,shuttle,11
3,285,2018-05-04,09:10,Kisii,Nairobi,shuttle,11
4,286,2018-05-04,09:20,Kisii,Nairobi,shuttle,11

## 1.2 Previewing our Dataset

In [5]:
# Let's preview the first 10 rows of our data
# 
df.head(10)

,ride_id,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,247,2018-05-07,07:06,Kisii,Nairobi,Bus,49
1,256,2018-05-06,11:08,Kisii,Nairobi,shuttle,11
2,275,2018-05-04,05:00,Kisii,Nairobi,shuttle,11
3,285,2018-05-04,09:10,Kisii,Nairobi,shuttle,11
4,286,2018-05-04,09:20,Kisii,Nairobi,shuttle,11
5,287,2018-05-04,07:02,Kisii,Nairobi,Bus,49
6,288,2018-05-04,09:30,Kisii,Nairobi,shuttle,11
7,292,2018-05-04,19:03,Kisii,Nairobi,Bus,49
8,298,2018-05-04,09:00,Kisii,Nairobi,shuttle,11
9,302,2018-05-04,08:40,Kisii,Nairobi,shuttle,11

## 1.3 Accessing Information about our Dataset

In [6]:
# Getting to know more about the dataset by accessing its information
#
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1111 entries, 0 to 1110
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ride_id       1111 non-null   int64
 1   travel_date   1111 non-null   object
 2   travel_time   1111 non-null   object
 3   travel_from   1111 non-null   object
 4   travel_to     1111 non-null   object
 5   car_type      1111 non-null   object
 6   max_capacity  1111 non-null   int64
dtypes: int64(2), object(5)
memory usage: 39.1+ KB

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [7]:
# Challenge 1
# How many trips were taken on the 22/04/18?
# 
df['travel_date'] = pd.to_datetime(df['travel_date'], format="%Y-%m-%d")
df['travel_time'] = pd.to_datetime(df['travel_time'], format="%H:%M")
df['travel_time'] = [time.time() for time in df['travel_time']]

trips = df[df['travel_date'] == '2018-04-22']
print(f"Trips made during the period is {len(trips)}")

Trips made during the period is 66

In [8]:
# Challenge 2
# Which type of vehicle travelled on 23/04/18 from Kisii to Nairobi at 7.15am?
#
df[(df['travel_from'] == 'Kisii') & (df['travel_to'] == 'Nairobi') & (df['travel_date'] == "2018/04/23") & (df['travel_time'] == '07:15:00')]

Empty DataFrame
Columns: [ride_id, travel_date, travel_time, travel_from, travel_to, car_type, max_capacity]
Index: []

In [9]:
# Challenge 3
# How many trips were made from Kisii to Nairobi?
# 
len(df[(df['travel_from'] == 'Kisii') & (df['travel_to'] == 'Nairobi')])

545

In [10]:
# Challenge 4
# How many trips were made by shuttle from Nairobi?
# 
len(df[(df['car_type'] == 'shuttle') & (df['travel_from'] == 'Nairobi')])

0

In [11]:
# Challenge 5
# How many trips were made by bus from Nairobi to Awendo?
# 
len(df[(df['travel_from'] == 'Nairobi') & (df['travel_to'] == 'Awendo')])

0

In [12]:
# Challenge 6
# Which was the most travelled from destination by bus?
# 
df['count']  = 1
group_data = df.groupby(['travel_from', 'car_type'])['count'].count()
index = group_data.index

bus_travels = {}

for val in index:
    if val[1]== "Bus":
        bus_travels[val] = group_data[val]

        
all_values = bus_travels.values()
max_value = max(all_values)

for key,value in bus_travels.items():
    if value == max_value:
        print(key, value)

('Rongo', 'Bus') 115

In [13]:
# Challenge 7
# Which was the most travelled to destination?
# 
to_list = list(df['travel_to'])
destinations = set(df['travel_to'])

from collections import Counter
Counter(to_list)

Counter({'Nairobi': 1111})

In [32]:
# Challenge 8
# Which was the most travelled destination by bus?
#
alist = ['Bus']
bus_travels = df[df['car_type'].isin(alist)]

from collections import Counter
Counter(bus_travels['travel_to'])

Counter({'Nairobi': 599})

In [43]:
# Challenge 9
# Which town did not have a departure by shuttle?
# 
depature_towns = set(df['travel_from'])

alist = ['shuttle']
shuttle_travels = df[df['car_type'].isin(alist)]

shuttle_travels[shuttle_travels['travel_from'].isin(depature_towns)]

,ride_id,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity,count
1,256,2018-05-06,11:08:00,Kisii,Nairobi,shuttle,11,1
2,275,2018-05-04,05:00:00,Kisii,Nairobi,shuttle,11,1
3,285,2018-05-04,09:10:00,Kisii,Nairobi,shuttle,11,1
4,286,2018-05-04,09:20:00,Kisii,Nairobi,shuttle,11,1
6,288,2018-05-04,09:30:00,Kisii,Nairobi,shuttle,11,1
...,...,...,...,...,...,...,...,...
1067,15260,2018-05-04,06:58:00,Kijauri,Nairobi,shuttle,11,1
1070,15263,2018-05-04,07:00:00,Kijauri,Nairobi,shuttle,11,1
1078,15279,2018-05-04,06:00:00,Kijauri,Nairobi,shuttle,11,1
1079,15280,2018-05-04,06:30:00,Keroka,Nairobi,shuttle,11,1
1080,15282,2018-05-04,05:40:00,Kijauri,Nairobi,shuttle,11,1

In [49]:
# Challenge 10
# Which were the most 5 travelled to destinations?
# 
from collections import Counter
Counter(df['travel_to'])

Counter({'Nairobi': 1111})

In [51]:
# Challenge 11
# Which were the least 5 travelled to destinations?
#
set(df['travel_to']) #nairobi was the only destionation in the dataset

{'Nairobi'}

In [74]:
# Challenge 12
# If all shuttles travelled with full capacity, how many people travelled in shuttles from Kisii to Nairobi in the month of May?
#
#df[df['travel-date'][5]]
df['month'] = pd.DatetimeIndex(df['travel_date']).month
kisii_nai_shuttle_may = df[(df['travel_from']=='Kisii') & (df['travel_to']=='Nairobi') & (df['month']==5) & (df['car_type']=='shuttle')]
total_shuttle = sum(kisii_nai_shuttle_may['count'])
total_travellers = total_shuttle * kisii_nai_shuttle_may['max_capacity'][1]
print(total_travellers)

1474

In [81]:
# Challenge 13
# Which date had the highest no. of trips in June?
#
months = set(df['month'])
print(f"we only have {months} in the dataset")

we only have {4, 5} in the dataset

In [115]:
# Challenge 14
# On average, how many trips were made by all vehicles in a day?
#
days_no = len(set(df['travel_date']))
trips = df['count'].sum()
average_trips = trips/days_no
print(f"The average trips made in the period is {average_trips}")

The average trips made in the period is 61.72222222222222

1111

In [122]:
# Challenge 15 
# On average, how many buses and shuttles travelled in a day?
# 
alist= ['Bus', 'shuttle']
bus_shuttle_travels = df[df['car_type'].isin(alist)]

trips = bus_shuttle_travels['count'].sum()
days_no = len(set(bus_shuttle_travels['travel_date']))

average_trips = trips/days_no

print(f"The average trips made in the period is {average_trips}")